UTAF_Base/requestFiles/PTS_UpdatePerson_withEID.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://api.web.bc/api/schema/commoncontext/v2" xmlns:v1="http://api.web.bc/api/schema/commoncontext/transaction/v1" xmlns:v11="http://api.web.bc/api/schema/commoncontext/consumertransaction/v1" xmlns:v12="http://api.web.bc/capability/business/b182-01/services/personupdating/flv000164/v1" xmlns:v13="http://api.web.bc/capability/business/b182-01/objects/requestsubmitpersonupdating/flv000164/v1">
   <soapenv:Header>
      <v2:CommonContextRequest>
         <v2:transaction>
            <v1:messageId>${Req_corrId}</v1:messageId>
            <!--Optional:-->
            <v1:correlationId>${Req_corrId}</v1:correlationId>
            <v1:conversationId>${Req_conversationId}</v1:conversationId>
            <v1:dateTimeCreated>${Req_dateTimeCreated}</v1:dateTimeCreated>
         </v2:transaction>
         <!--Optional:-->
      </v2:CommonContextRequest>
   </soapenv:Header>
   <soapenv:Body>
      <v12:RequestDataSubmitPersonUpdating>
         <v12:serviceContext>
            <v12:transactionData>
               <!--Optional:-->
               <v12:endUserId>PTS</v12:endUserId>
               <!--Optional:-->
               <v12:endUserLanguage>EN</v12:endUserLanguage>
               <v12:consumerApplication>SHE</v12:consumerApplication>
            </v12:transactionData>
         </v12:serviceContext>
         <v12:serviceData>
            <v12:person>

               <v13:name>                
                  <v13:preferredFirstName>${Req_preferredFirstName}</v13:preferredFirstName>
               </v13:name>
               <v13:party>
                  <!--Optional:-->
                  <v13:legalLanguage>
                     <v13:alpha2Code>${Req_legalLanguage_alpha2Code}</v13:alpha2Code>
                  </v13:legalLanguage>
                  <v13:preferredCommunicationLanguage>
                    <v13:alpha2Code>${Req_preferredCommunicationLanguage_alpha2Code}</v13:alpha2Code>
                  </v13:preferredCommunicationLanguage>
                  <v13:legalAddress>
                     <v13:geographicAddressIdentifier>
                        <v13:id>${Req_geographicAddressIdentifier_id}</v13:id>                       
                        <v13:idContext>
                           <v13:value>${Req_idContext_value}</v13:value>
                        </v13:idContext>
                     </v13:geographicAddressIdentifier>
                  </v13:legalAddress>
               </v13:party>
               <v13:identifier>
                  <v13:id>${Req_identifier_id}</v13:id>
                  <!--Optional:-->
                  <v13:idScope>
                     <v13:value>ENT</v13:value>
                  </v13:idScope>
                  <!--Optional:-->
                  <v13:idContext>
                     <v13:value>B182</v13:value>
                  </v13:idContext>
               </v13:identifier>
               <v13:credential>
                  <!--You have a CHOICE of the next 2 items at this level-->
                  <v13:EIdentityCard>
                  
                     <v13:cardNumber>FM/fdM1z4452Tw5XnQAPkw==</v13:cardNumber>
                     <!--Optional:-->
                     <!--Optional:-->
                     <v13:dateOfBirth>${Req_EIdentityCard_dateOfBirth}</v13:dateOfBirth>
                     <!--Optional:-->
                     <v13:lastName>${Req_EIdentityCard_lastName}</v13:lastName>
                     <!--Optional:-->
                     <v13:givenNames>${Req_EIdentityCard_givenNames}</v13:givenNames>
                     <!--Optional:-->
                     <v13:assuranceLevel>
                        <v13:value>HIGH</v13:value>
                     </v13:assuranceLevel>
                     <!--Optional:-->
                    
                  </v13:EIdentityCard>
               </v13:credential>
              
            </v12:person>
         </v12:serviceData>
      </v12:RequestDataSubmitPersonUpdating>
   </soapenv:Body>
</soapenv:Envelope>